<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"cafde3658bd027bdaf7ce4ec43a6429fdcf04d3976118c40b37d5404e4bf9332","plan_job_ref":"Job .github/workflows/_test-tf.yaml #190 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11361132998","plan_out_hash":"3320f1e4bd62dbcab97524bd5e727544a01f1eb750e7fb4ca0def70f626a1083","plan_hash":"8108358077d150a89cf73a6586959b2c0fa82c1c8d8064f94b642a33b3d6ef17","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #190](https://github.com/tx-pts-dai/github-workflows/actions/runs/11361132998)